// 所有的格式
const format =
    [
    // 一条微博热搜
    {
        // 微博名称
        title: "#张恒当然是我的宝宝#",
        // 时间
        time: "2023-05-15",
        // 总的评论数
        total: 2000,
        // 情绪数据
        emotions: [
            // 下面是列举
            {
                // 情绪名称
                title: "情绪A",
                // 情绪值 0 - 1
                count: 0.5
            },
            {
                // 情绪名称
                title: "情绪B",
                // 情绪值 0 - 1
                count: 0.3
            }
        ],
        // 词云
        cloudList: [
            {
                // 热词
                text: "郑爽",
                // 词频
                size: 2085,
                // 关联热词
                relations: ["底线", "回应文"],
            },
            {  // 热词
                text: "张恒",
                // 词频
                size: 1850,
                // 关联热词
                relations: ["出轨", "底线"],
            },
        ],
        // 失控等级 0: 低, 中: 1, 2: 高
        rank: 1,
        // 失控开始时间
        startTime: "2023-05-17",
        // 地图数据
        mapData: [
            {
                // 评论数
                total: 244,
                // 评论最多的词语
                title: "张衡",
                // 评论地区 （省份名）
                region: "北京"
            },
            {
                // 评论数
                total: 244,
                // 评论最多的词语
                title: "邓爽",
                // 评论地区
                region: "浙江"
            }
        ]
    }
]
